//*****************************************************************************
//
// ポストエフェクト（シェーダー利用）
//
//*****************************************************************************

#pragma once

#include "..\\..\\GameBase.h"

#include <string>

//ポストエフェクト用頂点フォーマット
struct POSTEFFECT_VERTEX_FORMAT {
	D3DXVECTOR3 position;
	Coord coord;
};

class PostEffect
{
public:

	//=============================================================================
	// コンストラクタ
	//=============================================================================
	PostEffect();

	//=============================================================================
	// デストラクタ
	//=============================================================================
	~PostEffect();

	//=============================================================================
	// 初期化
	// 引　数：Engine*    エンジンクラスのアドレス
	// 　　　　const WORD エフェクトＩＤ（resource.hで定義）
	// 　　　　string     テクニック名
	//=============================================================================
	void Initialize(Engine* pEngine, const WORD fxid, std::string technique);

	//=============================================================================
	// 準備（シーンのPreparePostEffectから呼び出す）
	// 引　数：Engine* エンジンクラスのアドレス
	//=============================================================================
	void Prepare(Engine* pEngine);

	//=============================================================================
	// レンダリング（シーンのDraw関数の最後に呼び出す）
	// 引　数：Engine* エンジンクラスのアドレス
	//=============================================================================
	void Render(Engine* pEngine);

	//=============================================================================
	// ポストエフェクト処理を止める（破棄する）
	//=============================================================================
	void End();

	//=============================================================================
	// ポストエフェクト処理を開始（再開）する
	//=============================================================================
	void EffectON();

	//=============================================================================
	// ポストエフェクト処理を中断する
	//=============================================================================
	void EffectOFF();

	//=============================================================================
	// ポストエフェクト処理が実行中かどうか調べる
	//=============================================================================
	bool IsUseEffect() const;

	//=============================================================================
	// 値の転送（float）
	// 引　数：const char* パラメータの名前
	// 　　　　const float パラメータの数値
	//=============================================================================
	void SetFloat(const char* parameter, const float value);

private:

	//ポストエフェクト実行中フラグ
	bool m_bUseEffect;

	//テクスチャへのレンダリング用
	LPDIRECT3DSURFACE9 m_pDepthBuffer;
	LPDIRECT3DSURFACE9 m_pOldDepthBuffer;
	LPDIRECT3DTEXTURE9 m_pFullScreenTexture;
	LPDIRECT3DSURFACE9 m_pFullScreenSurface;
	LPDIRECT3DSURFACE9 m_pOldSurface;

	//エフェクト（シェーダー）
	ID3DXEffect* m_pEffect;

	//描画用板ポリゴンの頂点情報
	POSTEFFECT_VERTEX_FORMAT vertices[4];

	//-----------------------------------------------------------------------------
	// 深度バッファ、レンダリング用テクスチャ、サーフェスの初期化
	// 引　数：LPDIRECT3DDEVICE9 ３Ｄデバイスのアドレス
	//-----------------------------------------------------------------------------
	void InitializeDepthTextureSurce(LPDIRECT3DDEVICE9 pDevice);

	//-----------------------------------------------------------------------------
	// シェーダーのロード
	// 引　数：LPDIRECT3DDEVICE9 ３Ｄデバイスのアドレス
	// 　　　　const WORD        エフェクトＩＤ（resource.hで定義）
	// 　　　　string            テクニック名
	//-----------------------------------------------------------------------------
	void LoadShader(LPDIRECT3DDEVICE9 pDevice, const WORD fxid, std::string technique);

	//-----------------------------------------------------------------------------
	// 頂点情報の設定
	//-----------------------------------------------------------------------------
	void SetVertices();

	//-----------------------------------------------------------------------------
	// 確保したメモリの解放
	//-----------------------------------------------------------------------------
	void Release();
};

