//*****************************************************************************
//
// ＳＥ管理（DirectSound）
//
// DSManage.h
//
// K_Yamaoka
//
// 2021/10/06
//
// 2023/08/28 周波数、音量、パンを調整する関数名を変更
//
//*****************************************************************************

#pragma once

#include <d3dx9.h>

#include <windows.h>

#include <map>
#include <string>

#include "DS.h"

#include "..\\Exception\\DxSystemException.h"

class DSManage
{
public:

	//=============================================================================
	// コンストラクタ
	//=============================================================================
	DSManage();

	//=============================================================================
	// デストラクタ
	//=============================================================================
	~DSManage();

	//=============================================================================
	// サウンド管理クラスの初期化
	// 引　数：const HWND アプリケーションのウィンドウハンドル
	//=============================================================================
	void Initialize(const HWND hAppWnd);

	//=============================================================================
	// ＳＥの追加
	// 引　数：string ＳＥファイル名
	//=============================================================================
	void AddSE(std::string strFileName);

	//=============================================================================
	// ＳＥの再生
	// 引　数：string      ＳＥファイル名
	// 　　　：const DOWRD 優先度(0～0xffffffff)
	// 　　　：const bool  ループフラグ 
	//=============================================================================
	void PlaySE(std::string strFileName, const DWORD priority, const bool bLoop);

	//=============================================================================
	// ＳＥの停止
	// 引　数：string ＳＥファイル名
	//=============================================================================
	void StopSE(std::string strFileName);

	//=============================================================================
	// ＳＥの解放（省メモリ対策）
	// 引　数：string ＳＥファイル名
	//=============================================================================
	void ReleaseSE(std::string strFileName);

	//=============================================================================
	// すべてのＳＥの停止
	//=============================================================================
	void StopAllSE();

	//=============================================================================
	// ＳＥの周波数をリセット
	// 引　数：string ＳＥファイル名
	//=============================================================================
	void ResetFrequency(std::string strFileName);

	//=============================================================================
	// ＳＥの周波数を調整
	// 引　数：string    ＳＥファイル名
	// 　　　　const int 増減させる周波数
	//=============================================================================
	void ChangeFrequency(std::string strFileName, const int value);

	//=============================================================================
	// ＳＥのパンをリセット
	// 引　数：string ＳＥファイル名
	//=============================================================================
	void ResetPan(std::string strFileName);

	//=============================================================================
	// ＳＥのパンを調整
	// 引　数：string    ＳＥファイル名
	// 　　　　const int 増減させる数値
	//=============================================================================
	void ChangePan(std::string strFileName, const int value);

	//=============================================================================
	// ＳＥのボリュームをリセット
	// 引　数：string ＳＥファイル名
	//=============================================================================
	void ResetVolume(std::string strFileName);

	//=============================================================================
	// ＳＥのボリュームを調整
	// 引　数：string    ＳＥファイル名
	// 　　　　const int 増減させる数値
	//=============================================================================
	void ChangeVolume(std::string strFileName, const int value);

private:

	//DirectSoundのポインタ
	LPDIRECTSOUND8 m_pSound;

	//プライマリバッファのポインタ
	LPDIRECTSOUNDBUFFER m_pPrimary;

	//ＳＥ管理用コンテナ
	std::map< std::string, DS* > m_mapSE;

	//-----------------------------------------------------------------------------
	// Waveファイルを開く
	// 戻り値：HRESULT 成功 S_OK　失敗 エラーコード
	// 引　数：CHAR*         ファイル名
	// 　　　：HMMIO*        ハンドルへのポインタ
	// 　　　：WAVEFORMATEX* フォーマットへのポインタのアドレス
	// 　　　：MMCKINFO*     RIFFチャンク情報へのポインタ
	//-----------------------------------------------------------------------------
	HRESULT WaveFileOpen(CHAR* strFileName, HMMIO* phmmioIn, WAVEFORMATEX** ppwfxInfo, MMCKINFO* pckInRIFF);

	//-----------------------------------------------------------------------------
	// フォーマットチャンクデータの読み込み
	// 戻り値：HRESULT 成功 S_OK　失敗 エラーコード
	// 引　数：HMMIO*        ハンドルへのポインタ
	// 　　　：MMCKINFO*     RIFFチャンク情報へのポインタ
	// 　　　：WAVEFORMATEX* フォーマットへのポインタのアドレス
	//-----------------------------------------------------------------------------
	HRESULT ReadFormat(HMMIO hmmioIn, MMCKINFO* pckInRIFF, WAVEFORMATEX** ppwfxInfo);

	//-----------------------------------------------------------------------------
	// データチャンクへ進入
	// 戻り値：HRESULT 成功 S_OK　失敗 エラーコード
	// 引　数：HMMIO*    ハンドルへのポインタ
	// 　　　：MMCKINFO* データチャンク情報へのポインタ
	// 　　　：MMCKINFO* RIFFチャンク情報へのポインタ
	//-----------------------------------------------------------------------------
	HRESULT DescendDataChunk(HMMIO* phmmioIn, MMCKINFO* pckIn, MMCKINFO* pckInRIFF);

	//-----------------------------------------------------------------------------
	// データをバッファにコピーする
	// 戻り値：HRESULT 成功 S_OK　失敗 エラーコード
	// 引　数：HMMIO*    ハンドルへのポインタ
	// 　　　：UINT      データのバイト数
	// 　　　：BYTE*     バッファの先頭アドレス
	// 　　　：MMCKINFO* データチャンク情報へのポインタ
	//-----------------------------------------------------------------------------
	HRESULT CopyWaveData(HMMIO hmmioIn, UINT cbRead, BYTE* pbDest, MMCKINFO* pckIn);

	//-----------------------------------------------------------------------------
	// すべてのＳＥの削除
	// 戻り値：bool 成功 true、失敗 false
	//-----------------------------------------------------------------------------
	bool DeleteAllSE();

	//コピー防止
	DSManage& operator=(const DSManage&);
	DSManage(const DSManage&);
};