//*****************************************************************************
//
// ゲームオーバーシーン
//
//*****************************************************************************

#define _USING_V110_SDK71_ 1

#include "SceneGameover.h"

using namespace KeyString;
using namespace InputKey;
using namespace WindowSetting;
using namespace Common;

//=============================================================================
// コンストラクタ
// 引　数：Engine* エンジンクラスのアドレス
//=============================================================================
SceneGameover::SceneGameover(Engine *pEngine)
	: Scene(pEngine)
{

}

//=============================================================================
// デストラクタ
//=============================================================================
SceneGameover::~SceneGameover()
{
	Exit();
}

//=============================================================================
// シーンの実行時に１度だけ呼び出される開始処理関数
//=============================================================================
void SceneGameover::Start()
{
	m_setting.SceneResourceSetting(m_pEngine, SCENE_GAMEOVER);

	m_pEngine->PlaySE(SE_GAMEOVER);
}

//=============================================================================
// シーンの実行時に繰り返し呼び出される更新処理関数
//=============================================================================
void SceneGameover::Update()
{
	m_gameoverUI.Update(m_pEngine);

	if (m_gameoverUI.IsFadeInFinish() && m_pEngine->GetKeyStateSync(DIK_RETURN))
	{
		m_nowSceneData.Set(SCENE_GAME);
	}
}

//=============================================================================
// シーンの実行時に繰り返し呼び出される描画処理関数
//=============================================================================
void SceneGameover::Draw()
{
	m_pEngine->SpriteBegin();

	m_gameoverUI.Draw(m_pEngine);

	m_pEngine->SpriteEnd();
}

//=============================================================================
// シーンの終了時に呼び出される終了処理関数
//=============================================================================
void SceneGameover::Exit()
{
	m_setting.SceneResourceRelease(m_pEngine);
}

//=============================================================================
// シーンの実行時に繰り返し呼び出されるポストエフェクト（シェーダー）準備関数
//=============================================================================
void SceneGameover::PreparePostEffect()
{
}

//=============================================================================
// シーンの実行時に繰り返し呼び出される初心者用ポストエフェクト関数
//=============================================================================
void SceneGameover::PostEffectForBeginners()
{

}

#ifndef IMGUI_DISABLE
//=============================================================================
// 日本語入力用
//=============================================================================
void SceneGameover::ImGuiFrameProcess()
{

}
#endif
