//*****************************************************************************
//
// ゲームシーン
//
//*****************************************************************************

#pragma once

#include "..\\..\\GameBase.h"

#include "..\\Scene\\Scene.h"

#include "..\\..\\Object\\Engine\\ResourceSetting\\ResourceSetting.h"
#include "..\\..\\Object\\Engine\\GameSystem\\GameSystem.h"
#include "..\\..\\Object\\Player\\Player.h"
#include "..\\..\\Object\\Stage\\Stage.h"
#include "..\\..\\Object\\Stage\\Back\\Back.h"
#include "..\\..\\Object\\Engine\\DeltaTime\\DeltaTime.h"
#include "..\\..\\Object\\UI\\GameUI\\GameUI.h"

class SceneGame : public Scene
{
public:

	//=============================================================================
	// コンストラクタ
	// 引　数：Engine* エンジンクラスのアドレス
	//=============================================================================
	SceneGame(Engine *pEngine);

	//=============================================================================
	// デストラクタ
	//=============================================================================
	~SceneGame();

	//=============================================================================
	// シーンの実行時に１度だけ呼び出される開始処理関数
	//=============================================================================
	void Start();

	//=============================================================================
	// シーンの実行時に繰り返し呼び出される更新処理関数
	//=============================================================================
	void Update();

	//=============================================================================
	// シーンの実行時に繰り返し呼び出される描画処理関数
	//=============================================================================
	void Draw();

	//=============================================================================
	// シーンの終了時に呼び出される終了処理関数
	//=============================================================================
	void Exit();

	//=============================================================================
	// シーンの実行時に繰り返し呼び出されるポストエフェクト（シェーダー）準備関数
	//=============================================================================
	void PreparePostEffect();

	//=============================================================================
	// シーンの実行時に繰り返し呼び出される初心者用ポストエフェクト関数
	//=============================================================================
	void PostEffectForBeginners();

#ifndef IMGUI_DISABLE
	//=============================================================================
	// 日本語入力用
	//=============================================================================
	void ImGuiFrameProcess();
#endif

private:

	void UpdateBuildMode();
	void UpdatePlayer();
	void CheckSceneTransition();
	void ProcessBuildModeInput();

	void DrawBackground();

	ResourceSetting& m_setting = ResourceSetting::getInstance();
	GameSystem& m_system = GameSystem::getInstance();
	DeltaTime& m_delta = DeltaTime::getInstance();

	Back m_back;
	Stage m_stage;
	Player m_player;
	GameUI m_gameUI;

	Field m_field;

	bool m_is_ready;
};
